// about_us.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
      title: "北工大活动报名平台",
      content: "    北工大活动平台致力于为同学们提供更加便捷的服务，使同学们通过更方便的途径了解工大新闻，参加工大活动。",
      content_principle: "平台总则",
      principle: [{message:"用户在使用本平台的过程中不得违反国家法律法规。"},
                  {message:"本规定适用于平台所有用户。"},
                  {message:"本平台负责本规定的解释与执行。"}],
      private_info_title: "隐私政策",
      private_descript:"本平台的所有者，承诺保护您的在线隐私权。请阅读下列声明以便了解您在本平台登录以及使用本平台服务时，您的个人信息将会得到的对待。",
      private_info: [
                      { 
                       title:"个人信息的收集",
                       message:"当您使用本平台，以及通过平台参加活动时，即为您同意本平台将收集您的个人信息，并保存记录。本平台收集的个人信息包括但不限于：昵称、头像等。"
                      },
                      {
                        title:"个人信息的使用",
                        message:"本平台收集个人信息的基本目的是为了更好的了解我们的用户，以便向您提供特色服务和个性化服务。个人信息将主要用于以下几个目的：（1）对参加活动的用户进行及时的通知（2）用于平台信息的统计，如用户数量等。"
                      },
                      {
                        title:"个人信息的共享和披露",
                        message:"本平台收集您的个人信息，将仅用于为您提供相关服务，在未得到您的同意之前，您的任何个人信息将不会被提供给无关的第三方。 "
                      }
            ],
      copy_right_title: "版权说明",
      copy_right_message: "所有“内容”的版权归平台所有。您不得擅自进行任何分销、出售、修改、反编译、逆向工程、解拆或出于商业目的使用平台提供的内容。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})